[
    {
        "id": 1,
        "company": "Cashmate",
        "description": "An iOS budgeting app built to promote fiscal responsibility by motivating users through social engagement.",
        "image": "cashmate-mockup.png",
        "link": "Cashmate",
        "caseStudy":
        {
            "description":"Cashmate started with the recognition of mindless spending in everyday life. One tap of a plastic card and your money was gone too quick. Our team wanted to design an experience that forced the users to face the costs, but make it fun, social, and interactive. Hence Cashmate: the social budgeting app",
            "role":"UI/UX Designer",
            "method":"Figma, Miro, Jira",
            "steps": [
                {
                    "id": 1,
                    "title": "Exploring Brand Potential",
                    "image": "cashmate-1.png",
                    "caption": "The first thing I did was brainstorm visuals for what the app could look like when completed. What colors would be in use? What do I want the users to feel when they see the app? What thematic elements could be in play? When I gathered some ideas, I took them to my teams to decide on one."
                },
                {
                    "id": 2,
                    "title": "Solidifying Brand Identity",
                    "image": "cashmate-2.png",
                    "caption": "After the general direction was decided, I gathered assets to build on the brand. Modern, clean, but approachable. (Top: typography, bottom right: color palette, bottom: logo ideas)"
                },
                {
                    "id": 3,
                    "title": "Low-Fidelity Wireframes",
                    "image": "cashmate-3.png",
                    "caption": "We then sorted out user stories and boiled them down to 10 features we wanted to develop for the next few months. Then I got working on the low-fidelity wireframes right away. We first have the onboarding (row one) with the log-in/sign-in page, then the user sets the budget for the week. Then we have users inputting spending (row two) where they input a dollar amount and choose a category. Row three shows the social features of the app: the timeline, social profile, and finding friends."
                },
                {
                    "id": 4,
                    "title": "High-Fidelity Wireframes",
                    "image": "cashmate-4.png",
                    "caption": "After we built the app based on the low-fidelity wireframes, we ran user tests with students on campus. The high-fidelity wireframes were constructed based on their feedback. Now there is a better onboarding process (row one and two), a clear indication of actions to take for inputting spending (row three), and the use of colors to inform users of their status in budget."
                },
                {
                    "id": 5,
                    "title": "Final Product",
                    "image": "cashmate-5.png",
                    "caption": "In one semester – less than 4 months – Cashmate went from an idea to an app. Between these oversimplified 4 steps, we had 50+ problem validations, 60+ solution validations, 20+ solution interviews, 20+ usability interviews, and countless late nights with the team. "              
                }
            ]
        }
    },
    {
        "id": 2,
        "company": "BostonHacks 2021",
        "description": "One of the biggest student-run hackathons at Boston University, hosting over 260 students per year in the New England area.",
        "image": "bhacks-mockup.png",
        "link": "BostonHacks",
        "caseStudy":
        {
            "description":"BostonHacks requires a new website every year based on the theme of the hackathon. The Design Team is given less than a month to design the mobile and desktop wireframe for the site. It's also Design Team's responsibility to design social media graphics and swag design.",
            "role":"Design Team",
            "method":"Figma",
            "steps": [
                {
                    "id": 1,
                    "title": "Choosing Color Palette Based on the Theme",
                    "image": "bostonhacks-1.png",
                    "caption": "As the COVID crisis receded, we wanted to focus and look forward to the recovery after the global pandemic. Hence BostonHacks 2021 theme was \"Life After COVID.\" After rounds of brainstorming, we decided on yellow and orange as the main colors to represent the sunset, symbolizing an end of an era."
                },
                {
                    "id": 2,
                    "title": "Mobile-First Wireframes",
                    "image": "bostonhacks-2.png",
                    "caption": "To account for the mobile experience, we started with mobile wireframes and then expanded to the desktop version later on. Because these were my first website wireframes, the left wireframes are more explorative and naive. The second one to the end was chosen as the final design." 
                },
                {
                    "id": 3,
                    "title": "Additional Pages",
                    "image": "bostonhacks-3.png",
                    "caption": "After the landing page design was chosen, I designed the sponsorship information page and hacker status page based on the landing page." 
                },
                {
                    "id": 4,
                    "title": "Social Media Graphics",
                    "image": "bostonhacks-4.png",
                    "caption": "I had taken a liking to the triplet of red, blue, and pink motif that symbolized sunset, moonrise, and sunrise. So I continued the motif through the registration announcement posts and track announcement posts, which were both series of three posts. If I could redo these posts, I would fix the low contrast, especially in the pink track post (row 2 column 2)." 
                },
                {
                    "id": 5,
                    "title": "Swag Design",
                    "image": "bostonhacks-5.png",
                    "caption": "To finish up, here are some design candidates for the tote bag we gave out that year." 
                }
            ]
        }
    }
]